# StructuralSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSettings Class
Members See Also
---
Provides access to project-wide structural settings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class StructuralSettings : Element
```

Visual Basic
---
```text
Public Class StructuralSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class StructuralSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..StructuralSettings
# See Also
StructuralSettings Members
Autodesk.Revit.DB.Structure Namespace